<<babel-init>>

#+CAPTION: Text Colored Glasses
#+BEGIN_EXAMPLE

                                                     __
                                                    /  \ "I'll see you on __
                            /\                     /   /  the text side  /  \
                           /  \                   /       of the moon"  /   /
            -------R------/    \                _/_____       _______  /
            -------G-----/    --\-----W------- /       \ / \ /       \/
            -------B----/        \            |   Org   |   |  Mode   |
                       /          \            \_______/     \_______/
                      -------------

#+END_EXAMPLE

*** Add USER@HOSTNAME to mode line
    #+begin_src emacs-lisp
      (let ((pos (memq 'mode-line-modes mode-line-format)))
        (setcdr pos (cons (concat (getenv "USER") "@" (getenv "HOSTNAME") " ") (cdr pos))))
    #+end_src

    #+RESULTS:
    | gmj@vi | gmj@vi | vi | mode-line-misc-info | mode-line-end-spaces |

*** Backups

This is one of the things people usually want to change right away. By default, Emacs saves backup files in the current directory. These are the files ending in =~= that are cluttering up your directory lists. The following code stashes them all in =~/.emacs.d/backups=, where I can find them with =C-x C-f= (=find-file=) if I really need to.

#+BEGIN_SRC emacs-lisp :exports code 
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+END_SRC

#+RESULTS:
: ((. . ~/.emacs.d/backups))

Disk space is cheap. Save lots.

#+BEGIN_SRC emacs-lisp :exports code 
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC

#+RESULTS:
| .* | ~/.emacs.d/auto-save-list/ | t |

***** TODO Set up agenda time summary and formatting the way I like it
      - See
        http://emacs.stackexchange.com/questions/13793/how-to-add-a-column-in-org-mode-agenda-clockreport-to-show-percentage-of-time-fo
        for How to add a column in org-mode agenda clockreport to show
        percentage of time for each group of activities? 
      - See http://comments.gmane.org/gmane.emacs.orgmode/77120 to
        have percentages sum correctly when total is larger than a
        day. 

#+begin_src emacs-lisp
(setq org-time-clocksum-format "%d:%02d")
(setq org-agenda-clockreport-parameter-plist
      (quote (:link t :maxlevel 2 :fileskip0 t :stepskip0 t :narrow 35  :formula %)))

; http://emacs.stackexchange.com/questions/8093/how-can-i-get-the-tags-for-a-headline-in-a-clock-report-formula
; see ALLTAGS
; not quite sure what I want here.

;      (quote (:link t :maxlevel 2 :fileskip0 t :stepskip0 t :narrow 35  :properties ("ALLTAGS") :formula %)))
#+end_src

#+RESULTS:
| :link | t | :maxlevel | 2 | :fileskip0 | t | :stepskip0 | t | :narrow | 35 | :formula | % |

*** Set up to pull some RSS and Atom feeds
    :LOGBOOK:
    CLOCK: [2016-02-17 Wed 05:08]--[2016-02-17 Wed 05:40] =>  0:32
    :END:
    [2016-02-17 Wed 05:08]
    - See [[info:org#RSS%20feeds][info:org#RSS feeds]]
    - This is here as an example.  The actual subscriptions are
      environment specific had have moved to private configs.

      #+begin_src emacs-lisp  :exports code :tangle no
	(setq org-feed-alist
         '(("Slashdot"
            "http://rss.slashdot.org/Slashdot/slashdot"
            "~/txt/org/feeds.org" "Slashdot Entries")
           ("Sacha"
            "http://sachachua.com/blog/feed/"
            "~/txt/org/feeds.org" "Sacha Chua")
           ("Emacs News"
            "http://sachachua.com/blog/category/emacs-news/feed"
            "~/txt/org/feeds.org" "Emacs News")
           ("Tech Crunch"
            "http://feeds.feedburner.com/Techcrunch"
            "~/txt/org/feeds.org" "Tech Crunch")
           ("Reddit orgmode"
            "https://www.reddit.com/r/orgmode/.rss"
            "~/txt/org/feeds.org" "r/orgmode"
            :parse-entry org-feed-parse-atom-entry
            :parse-feed org-feed-parse-atom-feed)
           )
         )

      #+end_src

	 #+RESULTS:
	 | Slashdot       | http://rss.slashdot.org/Slashdot/slashdot          | ~/txt/org/feeds.org | Slashdot Entries |              |                           |             |                          |
	 | Sacha          | http://sachachua.com/blog/feed/                    | ~/txt/org/feeds.org | Sacha Chua       |              |                           |             |                          |
	 | Emacs News     | http://sachachua.com/blog/category/emacs-news/feed | ~/txt/org/feeds.org | Emacs News       |              |                           |             |                          |
	 | Tech Crunch    | http://feeds.feedburner.com/Techcrunch             | ~/txt/org/feeds.org | Tech Crunch      |              |                           |             |                          |
	 | Reddit orgmode | https://www.reddit.com/r/orgmode/.rss              | ~/txt/org/feeds.org | r/orgmode        | :parse-entry | org-feed-parse-atom-entry | :parse-feed | org-feed-parse-atom-feed |

*** Unfill paragraph

I unfill paragraphs a lot because Wordpress likes adding extra =<br>= tags if I don't. (I should probably just tweak my Wordpress installation.)

#+BEGIN_SRC emacs-lisp :exports code 
  (defun my/unfill-paragraph (&optional region)
    "Takes a multi-line paragraph and makes it into a single line of text."
    (interactive (progn
                   (barf-if-buffer-read-only)
                   (list t)))
    (let ((fill-column (point-max)))
      (fill-paragraph nil region)))
(global-set-key "\M-Q" 'my/unfill-paragraph)
#+END_SRC

#+RESULTS:
: my/unfill-paragraph

Also, =visual-line-mode= is so much better than =auto-fill-mode=. It doesn't actually break the text into multiple lines - it only looks that way.

#+BEGIN_SRC emacs-lisp :exports code 
;(remove-hook 'text-mode-hook #'turn-on-auto-fill)
;(add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+END_SRC

#+RESULTS:
| turn-on-visual-line-mode | text-mode-hook-identify |

*** Untabify python on save
; http://stackoverflow.com/questions/3313210/converting-this-untabify-on-save-hook-for-emacs-to-work-with-espresso-mode-or-a

#+BEGIN_SRC emacs-lisp :exports code 
;; untabify some modes
(setq alexott/untabify-modes '(python-mode emacs-lisp-mode lisp-mode))
(defun alexott/untabify-hook ()
  (when (member major-mode alexott/untabify-modes)
     (untabify (point-min) (point-max))))
(add-hook 'before-save-hook 'alexott/untabify-hook)
#+END_SRC

#+RESULTS:
| alexott/untabify-hook | time-stamp |

    
*** org2blog setup
#+begin_src emacs-lisp

(setq org2blog/wp-buffer-template
      "-----------------------
#+TITLE: %s
#+DATE: %s
#+CATEGORY: useful
#+TAGS: 
#+DESCRIPTION:
-----------------------\n")
(defun my-format-function (format-string)
  (format format-string
          org2blog/wp-default-title
          (format-time-string "%Y-%m-%d %a %T" (current-time))))
(setq org2blog/wp-buffer-format-function 'my-format-function)

(message "org2blog setup finished.")
#+end_src


#+END_SRC

#+RESULTS:
| sequence | TODO | IN-PROGRESS |   |   | DONE | WAITING | DELEGATED | CANCELED |

*** Code    
   #+BEGIN_SRC emacs-lisp :exports code 

   ; The old way
   (setq yow-file "~/.emacs.d/etc/yow.lines")
   ;(load "yow") ; Copy in my ~/elisp directory from disro emacs/lisp/obsolete/yow.el
   (global-set-key "\ey" 'yow)
   (yow)
   #+END_SRC

   #+RESULTS:
   : The PINK SOCKS were ORIGINALLY from 1952!!
   :  But they went to MARS around 1953!!

   #+BEGIN_SRC emacs-lisp :exports code 
   ; The new way
   (setq cookie-file "~/.emacs.d/etc/quotes.lines")

   #+END_SRC

   #+BEGIN_SRC emacs-lisp :exports code 
   ; The old way
   ;(psychoanalyze-pinhead) ; this never ends, and fills a buffer fast....
   #+END_SRC

   #+RESULTS:
* All done, YOW !!!
  #+BEGIN_SRC emacs-lisp :exports both
  (message (yow))
  
  #+END_SRC

  #+RESULTS:
  : OMNIVERSAL AWARENESS??  Oh, YEH!!  First you need 4 GALLONS of JELL-O
  :  and a BIG WRENCH!!...  I think you drop th'WRENCH in the JELL-O as if
  :  it was a FLAVOR, or an INGREDIENT...  ...or...I...um...  WHERE'S the
  :  WASHING MACHINES?

